# Задание 3
i = 1
while i < 8:
    print(i * '*')
    i+= 1
#Задание 4
print('Введите название команды для 4 задания')
print(input(), '- чемпион!')
#Задание 5
a, b, c = input(), input(), input()
print(c, b, a, sep='\n')
#Задание 6
print('I', 'LIKE', 'python', sep='***')
#Задание 7
n = input()
print(input(), input(), input(),sep=n)
#Задание 8
print('*****************')
print('*               *')
print('*               *')
print('*****************')